grisp-org/rtems-libbsd/rtemsbsd/sys/dev/usb/controller/atsam_otg.c
#include <machine/rtems-bsd-kernel-space.h>

/* $FreeBSD$ */
/*-
 * Copyright (c) 2016 Hans Petter Selasky. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 */

/*
 * This file contains the driver for the Atmel's SAM ARM series of USB
 * OTG controllers. It should be noted that the hardware does not
 * support the USB HIGH speed transaction translator which means FULL
 * and LOW speed devices will not work through USB HUBs unless the HUB
 * is FULL speed or the hardware is configured FULL speed only.
 */

#ifdef USB_GLOBAL_INCLUDE_FILE
#include USB_GLOBAL_INCLUDE_FILE
#else
#include <sys/stdint.h>
#include <sys/stddef.h>
#include <rtems/bsd/sys/param.h>
#include <sys/queue.h>
#include <sys/types.h>
#include <sys/systm.h>
#include <sys/kernel.h>
#include <sys/bus.h>
#include <sys/module.h>
#include <rtems/bsd/sys/lock.h>
#include <sys/mutex.h>
#include <sys/condvar.h>
#include <sys/sysctl.h>
#include <sys/sx.h>
#include <sys/unistd.h>
#include <sys/callout.h>
#include <sys/malloc.h>
#include <sys/priv.h>

#include <dev/usb/usb.h>
#include <dev/usb/usbdi.h>

#define	USB_DEBUG_VAR ats_otg_debug

#include <dev/usb/usb_core.h>
#include <dev/usb/usb_debug.h>
#include <dev/usb/usb_busdma.h>
#include <dev/usb/usb_process.h>
#include <dev/usb/usb_transfer.h>
#include <dev/usb/usb_device.h>
#include <dev/usb/usb_hub.h>
#include <dev/usb/usb_util.h>

#include <dev/usb/usb_controller.h>
#include <dev/usb/usb_bus.h>
#endif					/* USB_GLOBAL_INCLUDE_FILE */

#include <dev/usb/controller/atsam_otg_reg.h>
#include <dev/usb/controller/atsam_otg.h>

#define	ATS_OTG_BUS2SC(bus) \
   ((struct ats_otg_softc *)(((uint8_t *)(bus)) - \
    ((uint8_t *)&(((struct ats_otg_softc *)0)->sc_bus))))

#define	ATS_OTG_PC2SC(pc) \
   ATS_OTG_BUS2SC(USB_DMATAG_TO_XROOT((pc)->tag_parent)->bus)

#define	ATS_OTG_PC2UDEV(pc) \
   (USB_DMATAG_TO_XROOT((pc)->tag_parent)->udev)

#ifdef USB_DEBUG
static int ats_otg_debug = 0;

static
SYSCTL_NODE(_hw_usb, OID_AUTO, atsam_otg, CTLFLAG_RW, 0,
    "USB ATS OTG DCI");

SYSCTL_INT(_hw_usb_atsam_otg, OID_AUTO, debug, CTLFLAG_RWTUN,
    &ats_otg_debug, 0, "ATS OTG DCI debug level");
#endif

#define	ATS_OTG_INTR_ENDPT 1

#define	ATS_OTG_DEVIMR_THREAD_IRQ ( \
    USBHS_DEVIMR_WAKEUP | \
    USBHS_DEVIMR_EORST	| \
    USBHS_DEVIMR_SUSP)

#define	ATS_OTG_HSTIMR_THREAD_IRQ ( \
   USBHS_HSTIMR_HWUP	| \
   USBHS_HSTIMR_RXRSM	| \
   USBHS_HSTIMR_RSMED	| \
   USBHS_HSTIMR_RST	| \
   USBHS_HSTIMR_DDISC	| \
   USBHS_HSTIMR_DCONN)

/* prototypes */

static const struct usb_bus_methods ats_otg_bus_methods;
static const struct usb_pipe_methods ats_otg_non_isoc_methods;
static const struct usb_pipe_methods ats_otg_isoc_methods;

static ats_otg_cmd_t ats_otg_device_setup_rx;
static ats_otg_cmd_t ats_otg_device_data_rx;
static ats_otg_cmd_t ats_otg_device_data_tx;
static ats_otg_cmd_t ats_otg_device_data_tx_sync;

static ats_otg_cmd_t ats_otg_host_setup_tx;
static ats_otg_cmd_t ats_otg_host_data_rx;
static ats_otg_cmd_t ats_otg_host_data_tx;

static void ats_otg_root_intr(struct ats_otg_softc *);
static void ats_otg_init_fifo(struct ats_otg_softc *, uint8_t);
static void ats_otg_device_done(struct usb_xfer *, usb_error_t);
static void ats_otg_standard_done(struct usb_xfer *);
static void ats_otg_do_poll(struct usb_bus *);

/*
 * Here is a list of what the chip supports:
 */
static const struct usb_hw_ep_profile ats_otg_ep_profile[3] = {

	[0] = {
		.max_in_frame_size = 64,
		.max_out_frame_size = 64,
		.is_simplex = 1,
		.support_control = 1,
	},
	[1] = {
		.max_in_frame_size = 64,
		.max_out_frame_size = 64,
		.is_simplex = 1,
		.support_bulk = 1,
		.support_interrupt = 1,
		.support_isochronous = 1,
		.support_in = 1,
		.support_out = 1,
	},
	[2] = {
		.max_in_frame_size = 512,
		.max_out_frame_size = 512,
		.is_simplex = 1,
		.support_bulk = 1,
		.support_interrupt = 1,
		.support_isochronous = 1,
		.support_in = 1,
		.support_out = 1,
	},
};

static void
ats_otg_get_hw_ep_profile(struct usb_device *udev,
    const struct usb_hw_ep_profile **ppf, uint8_t ep_addr)
{
	if (ep_addr == 0)
		*ppf = ats_otg_ep_profile + 0;
	else if (ep_addr < ATS_OTG_MAX_DEVICE_HS_EP)
		*ppf = ats_otg_ep_profile + 2;
	else if (ep_addr < ATS_OTG_MAX_DEVICE_ENDPOINTS)
		*ppf = ats_otg_ep_profile + 1;
	else
		*ppf = NULL;
}

static void
ats_otg_clocks_on(struct ats_otg_softc *sc)
{
	if (sc->sc_flags.clocks_off &&
	    sc->sc_flags.port_powered) {
		uint32_t temp;

		DPRINTFN(5, "\n");

		temp = ATS_OTG_READ_4(sc, USBHS_CTRL) &
		    ~USBHS_CTRL_FRZCLK;
		ATS_OTG_WRITE_4(sc, USBHS_CTRL, temp);

		sc->sc_flags.clocks_off = 0;
	}
}

static void
ats_otg_clocks_off(struct ats_otg_softc *sc)
{
	if (!sc->sc_flags.clocks_off) {
		uint32_t temp;

		DPRINTFN(5, "\n");

		temp = ATS_OTG_READ_4(sc, USBHS_CTRL) |
		    USBHS_CTRL_FRZCLK;
		ATS_OTG_WRITE_4(sc, USBHS_CTRL, temp);

