grisp-org/rtems-libbsd/rtemsbsd/sys/dev/usb/controller/atsam_otg.c
		sc->sc_flags.clocks_off = 1;
	}
}

static void
ats_otg_pull_up(struct ats_otg_softc *sc)
{
	/* pullup D+, if possible */

	if (!sc->sc_flags.d_pulled_up &&
	    sc->sc_flags.port_powered) {
		uint32_t temp;

		temp = ATS_OTG_READ_4(sc, USBHS_DEVCTRL) &
		    ~USBHS_DEVCTRL_DETACH;
		ATS_OTG_WRITE_4(sc, USBHS_DEVCTRL, temp);

		sc->sc_flags.d_pulled_up = 1;
	}
}

static void
ats_otg_pull_down(struct ats_otg_softc *sc)
{
	/* pulldown D+, if possible */

	if (sc->sc_flags.d_pulled_up) {
		uint32_t temp;

		temp = ATS_OTG_READ_4(sc, USBHS_DEVCTRL) |
		    USBHS_DEVCTRL_DETACH;
		ATS_OTG_WRITE_4(sc, USBHS_DEVCTRL, temp);

		sc->sc_flags.d_pulled_up = 0;
	}
}

static void
ats_otg_resume_irq(struct ats_otg_softc *sc)
{
	if (sc->sc_flags.status_suspend) {
		/* update status bits */
		sc->sc_flags.status_suspend = 0;
		sc->sc_flags.change_suspend = 1;

		if (sc->sc_flags.status_device_mode) {
			/* Disable resume and enable suspend interrupt */
			ATS_OTG_WRITE_4(sc, USBHS_DEVIDR, USBHS_DEVIDR_WAKEUP);
			ATS_OTG_WRITE_4(sc, USBHS_DEVIER, USBHS_DEVIER_SUSP);
		}
		/* complete root HUB interrupt endpoint */
		ats_otg_root_intr(sc);
	}
}

static void
ats_otg_suspend_irq(struct ats_otg_softc *sc)
{
	if (!sc->sc_flags.status_suspend) {
		/* update status bits */
		sc->sc_flags.status_suspend = 1;
		sc->sc_flags.change_suspend = 1;

		if (sc->sc_flags.status_device_mode) {
			/* Disable suspend and enable resume interrupt */
			ATS_OTG_WRITE_4(sc, USBHS_DEVIDR, USBHS_DEVIDR_SUSP);
			ATS_OTG_WRITE_4(sc, USBHS_DEVIER, USBHS_DEVIER_WAKEUP);
		}
		/* complete root HUB interrupt endpoint */
		ats_otg_root_intr(sc);
	}
}

static void
ats_otg_wakeup_peer(struct ats_otg_softc *sc)
{
	uint32_t temp;

	if (!sc->sc_flags.status_suspend)
		return;

	DPRINTFN(5, "Remote wakeup\n");

	ats_otg_clocks_on(sc);

	if (sc->sc_flags.status_device_mode) {

		temp = ATS_OTG_READ_4(sc, USBHS_DEVCTRL) |
		    USBHS_DEVCTRL_RMWKUP;
		ATS_OTG_WRITE_4(sc, USBHS_DEVCTRL, temp);

		/* wait 8 milliseconds */
		usb_pause_mtx(&sc->sc_bus.bus_mtx, hz / 125);

		/* hardware should have cleared RMWKUP bit */
	} else {
		temp = ATS_OTG_READ_4(sc, USBHS_HSTCTRL);

		temp &= ~(USBHS_HSTCTRL_RESET | USBHS_HSTCTRL_RESUME);

		/* enable USB port */
		temp |= USBHS_HSTCTRL_SOFE;
		ATS_OTG_WRITE_4(sc, USBHS_HSTCTRL, temp);

		/* wait 10ms */
		usb_pause_mtx(&sc->sc_bus.bus_mtx, hz / 100);

		/* resume port */
		temp |= USBHS_HSTCTRL_RESUME;
		ATS_OTG_WRITE_4(sc, USBHS_HSTCTRL, temp);

		/* Wait 100ms for resume signalling to complete. */
		usb_pause_mtx(&sc->sc_bus.bus_mtx, hz / 10);

		/* clear resume */
		temp &= ~USBHS_HSTCTRL_RESUME;
		ATS_OTG_WRITE_4(sc, USBHS_HSTCTRL, temp);

		/* Wait 4ms */
		usb_pause_mtx(&sc->sc_bus.bus_mtx, hz / 250);
	}

	/* need to fake resume IRQ */
	ats_otg_resume_irq(sc);
}

static void
ats_otg_set_address(struct ats_otg_softc *sc, uint8_t addr)
{
	uint32_t temp;

	DPRINTFN(5, "addr=%d\n", addr);

	temp = ATS_OTG_READ_4(sc, USBHS_DEVCTRL) &
	    ~USBHS_DEVCTRL_UADD(-1U);
	temp |= USBHS_DEVCTRL_UADD(addr) |
	    USBHS_DEVCTRL_ADDEN;

	/* write and enable new address */
	ATS_OTG_WRITE_4(sc, USBHS_DEVCTRL, temp);
}

static uint8_t
ats_otg_device_setup_rx(struct ats_otg_softc *sc, struct ats_otg_td *td)
{
	struct usb_device_request req __aligned(4);
	uint32_t temp;
	uint16_t count;

	/* get endpoint status */
	temp = ATS_OTG_READ_4(sc, USBHS_DEVEPTISR(0));

	DPRINTFN(5, "DEVEPTISR(0)=0x%08x\n", temp);

	if (!(temp & USBHS_DEVEPTISR_RXSTP))
		goto not_complete;

	/* clear did stall */
	td->did_stall = 0;

	/* get the packet byte count */
	count = (temp & USBHS_DEVEPTISR_BYCT(-1U)) /
	    USBHS_DEVEPTISR_BYCT(1);

	/* verify data length */
	if (count != td->remainder) {
		DPRINTFN(0, "Invalid SETUP packet "
		    "length, %d bytes\n", count);
		goto not_complete;
	}
	if (count != sizeof(req)) {
		DPRINTFN(0, "Unsupported SETUP packet "
		    "length, %d bytes\n", count);
		goto not_complete;
	}
	/* receive data */
	ATS_OTG_READ_FIFO_1(sc, td->ep_no, (void *)&req, sizeof(req));

	/* copy data into real buffer */
	usbd_copy_in(td->pc, 0, &req, sizeof(req));

	td->offset = sizeof(req);
	td->remainder = 0;

	/* sneak peek the set address */
	if ((req.bmRequestType == UT_WRITE_DEVICE) &&
	    (req.bRequest == UR_SET_ADDRESS)) {
		sc->sc_dv_addr = req.wValue[0] & 0x7F;

		/* must write address before ZLP */
		temp = ATS_OTG_READ_4(sc, USBHS_DEVCTRL) &
		    ~USBHS_DEVCTRL_UADD(-1U);
		temp |= USBHS_DEVCTRL_UADD(sc->sc_dv_addr);
		ATS_OTG_WRITE_4(sc, USBHS_DEVCTRL, temp);
	} else {
		sc->sc_dv_addr = 0xFF;
	}

	/* Clear SETUP packet interrupt and all other previous interrupts */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTICR(0), -1U);
	return (0);			/* complete */

not_complete:
	/* abort any ongoing transfer */
	if (!td->did_stall) {
		DPRINTFN(5, "stalling\n");
		ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIER(0), USBHS_DEVEPTIER_STALLRQ);
		td->did_stall = 1;
	}
	/* Clear SETUP packet interrupt and all other previous interrupts */
	if (temp & USBHS_DEVEPTISR_RXSTP)
		ATS_OTG_WRITE_4(sc, USBHS_DEVEPTICR(0), -1U);

	/* we only want to know if there is a SETUP packet */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIER(0),
	    USBHS_DEVEPTIER_RXSTP);
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIDR(0),
	    USBHS_DEVEPTIDR_TXIN | USBHS_DEVEPTIDR_RXOUT);
	ATS_OTG_WRITE_4(sc, USBHS_DEVIER, USBHS_DEVIER_PEP_MASK(0));

	return (1);			/* not complete */
}

static uint8_t
ats_otg_device_data_rx(struct ats_otg_softc *sc, struct ats_otg_td *td)
{
	struct usb_page_search buf_res;
	uint32_t temp;
	uint16_t count;
	uint8_t to;
	uint8_t got_short;

	to = 3;				/* don't loop forever! */
	got_short = 0;
repeat:
	/* get endpoint status */
	temp = ATS_OTG_READ_4(sc, USBHS_DEVEPTISR(td->ep_no));

	DPRINTFN(5, "DEVEPTISR(%u)=0x%08x rem=%u\n",
	    td->ep_no, temp, td->remainder);

	/* check if any of the FIFO banks have data */
	if (temp & USBHS_DEVEPTISR_RXSTP) {
		if (td->remainder == 0) {
			/*
			 * We are actually complete and have
			 * received the next SETUP
			 */
			DPRINTFN(5, "faking complete\n");
			return (0);	/* complete */
		}
		/*
	         * USB Host Aborted the transfer.
	         */
		td->error_any = 1;
		return (0);		/* complete */
	}
	if ((temp & USBHS_DEVEPTISR_NBUSYBK(-1U)) == 0) {
		/* cannot read any data */
		goto not_complete;
	}
	/* get the packet byte count */
	count = (temp & USBHS_DEVEPTISR_BYCT(-1U)) /
	    USBHS_DEVEPTISR_BYCT(1);

	/* verify the packet byte count */
	if (count != td->max_packet_size) {
		if (count < td->max_packet_size) {
			/* we have a short packet */
			td->short_pkt = 1;
			got_short = 1;
		} else {
			/* invalid USB packet */
			td->error_any = 1;
			return (0);	/* we are complete */
		}
	}
	/* verify the packet byte count */
	if (count > td->remainder) {
		/* invalid USB packet */
		td->error_any = 1;
		return (0);		/* we are complete */
	}
	while (count > 0) {
		usbd_get_page(td->pc, td->offset, &buf_res);

		/* get correct length */
		if (buf_res.length > count) {
			buf_res.length = count;
		}
		/* receive data */
		ATS_OTG_READ_FIFO_1(sc, td->ep_no, buf_res.buffer, buf_res.length);

		/* update counters */
		count -= buf_res.length;
		td->offset += buf_res.length;
		td->remainder -= buf_res.length;
	}

	/* clear OUT packet interrupt */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTICR(td->ep_no), USBHS_DEVEPTICR_RXOUT);

	/* release FIFO bank */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIDR(td->ep_no), USBHS_DEVEPTIDR_FIFOCON);

