grisp-org/rtems-libbsd/rtemsbsd/sys/dev/usb/controller/atsam_otg.c
	/* check if we are complete */
	if ((td->remainder == 0) || got_short) {
		if (td->short_pkt) {
			/* we are complete */
			return (0);
		}
		/* else need to receive a zero length packet */
	}
	if (--to)
		goto repeat;

not_complete:
	/* we only want to know if there is a SETUP packet or OUT packet */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIER(td->ep_no),
	    USBHS_DEVEPTIER_RXSTP | USBHS_DEVEPTIMR_RXOUT);
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIDR(td->ep_no),
	    USBHS_DEVEPTIDR_TXIN);
	ATS_OTG_WRITE_4(sc, USBHS_DEVIER, USBHS_DEVIER_PEP_MASK(td->ep_no));
	return (1);			/* not complete */
}

static uint8_t
ats_otg_device_data_tx(struct ats_otg_softc *sc, struct ats_otg_td *td)
{
	struct usb_page_search buf_res;
	uint32_t temp;
	uint16_t count;
	uint8_t to;

	to = 3;				/* don't loop forever! */
repeat:
	/* get endpoint status */
	temp = ATS_OTG_READ_4(sc, USBHS_DEVEPTISR(td->ep_no));

	DPRINTFN(5, "DEVEPTISR(%u)=0x%08x rem=%u\n",
	    td->ep_no, temp, td->remainder);

	if (temp & USBHS_DEVEPTISR_RXSTP) {
		/*
	         * The current transfer was aborted
	         * by the USB Host
	         */
		td->error_any = 1;
		return (0);		/* complete */
	}
	if (temp & USBHS_DEVEPTISR_NBUSYBK(-1U)) {
		/* cannot write any data - a bank is busy */
		goto not_complete;
	}
	count = td->max_packet_size;
	if (td->remainder < count) {
		/* we have a short packet */
		td->short_pkt = 1;
		count = td->remainder;
	}
	while (count > 0) {

		usbd_get_page(td->pc, td->offset, &buf_res);

		/* get correct length */
		if (buf_res.length > count) {
			buf_res.length = count;
		}
		/* transmit data */
		ATS_OTG_WRITE_FIFO_1(sc, td->ep_no, buf_res.buffer, buf_res.length);

		/* update counters */
		count -= buf_res.length;
		td->offset += buf_res.length;
		td->remainder -= buf_res.length;
	}

	/* clear IN packet interrupt */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTICR(td->ep_no), USBHS_DEVEPTICR_TXIN);

	/* allocate FIFO bank */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIDR(td->ep_no), USBHS_DEVEPTIDR_FIFOCON);

	/* check remainder */
	if (td->remainder == 0) {
		if (td->short_pkt) {
			return (0);	/* complete */
		}
		/* else we need to transmit a short packet */
	}
	if (--to)
		goto repeat;

not_complete:
	/* we only want to know if there is a SETUP packet or free IN packet */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIER(td->ep_no),
	    USBHS_DEVEPTIER_RXSTP | USBHS_DEVEPTIER_TXIN);
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIDR(td->ep_no),
	    USBHS_DEVEPTIDR_RXOUT);
	ATS_OTG_WRITE_4(sc, USBHS_DEVIER, USBHS_DEVIER_PEP_MASK(td->ep_no));
	return (1);			/* not complete */
}

static uint8_t
ats_otg_device_data_tx_sync(struct ats_otg_softc *sc, struct ats_otg_td *td)
{
	uint32_t temp;

	/* get endpoint status */
	temp = ATS_OTG_READ_4(sc, USBHS_DEVEPTISR(td->ep_no));

	DPRINTFN(5, "DEVEPTISR(%u)=0x%08x rem=%u\n",
	    td->ep_no, temp, td->remainder);

	if (temp & USBHS_DEVEPTISR_RXSTP) {
		DPRINTFN(5, "faking complete\n");
		/* Race condition */
		return (0);		/* complete */
	}
	/*
	 * The control endpoint has only got one bank, so if that bank
	 * is free the packet has been transferred!
	 */
	if (temp & USBHS_DEVEPTISR_NBUSYBK(-1U)) {
		/* cannot write any data - a bank is busy */
		goto not_complete;
	}
	if (sc->sc_dv_addr != 0xFF) {
		/* set new address */
		ats_otg_set_address(sc, sc->sc_dv_addr);
	}
	return (0);			/* complete */

not_complete:
	/* we only want to know if there is a SETUP packet or free IN packet */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIER(td->ep_no),
	    USBHS_DEVEPTIER_RXSTP | USBHS_DEVEPTIER_TXIN);
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIDR(td->ep_no),
	    USBHS_DEVEPTIDR_RXOUT);
	ATS_OTG_WRITE_4(sc, USBHS_DEVIER, USBHS_DEVIER_PEP_MASK(td->ep_no));
	return (1);			/* not complete */
}

static uint8_t
ats_otg_host_channel_alloc(struct ats_otg_softc *sc, struct ats_otg_td *td,
    uint8_t ep_dir)
{
	uint32_t temp;
	uint8_t x;

	if (td->channel < ATS_OTG_MAX_HOST_CHANNELS)
		return (0);		/* already allocated */

	/* check if device is suspended */
	if (ATS_OTG_PC2UDEV(td->pc)->flags.self_suspended != 0)
		return (1);		/* busy - cannot transfer data */

	for (x = 0; x != ATS_OTG_MAX_HOST_CHANNELS; x++) {
		/* check if channel is allocated */
		if (sc->sc_chan_state[x].allocated != 0)
			continue;

		/* grab channel */
		sc->sc_chan_state[x].allocated = 1;
		td->channel = x;
		break;
	}
	if (x == ATS_OTG_MAX_HOST_CHANNELS)
		return (1);		/* busy */

	/* enable and reset host channel */
	temp = ATS_OTG_READ_4(sc, USBHS_HSTPIP);
	temp |= USBHS_HSTPIP_PEN(x);
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIP, temp);
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIP, temp | USBHS_HSTPIP_PRST(x));
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIP, temp);

	/* get current configuration */
	temp = ATS_OTG_READ_4(sc, USBHS_HSTPIPCFG(x)) &
	    ~(USBHS_HSTPIPCFG_PTOKEN(-1U) |
	    USBHS_HSTPIPCFG_PEPNUM(-1U) |
	    USBHS_HSTPIPCFG_PTYPE(-1U));

	temp |= USBHS_HSTPIPCFG_PEPNUM(td->ep_no);

	/* write endpoint number */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPCFG(x), temp);

	switch (td->ep_type) {
	case UE_CONTROL:
		if (td->toggle != 0 || td->set_toggle != 0) {
			td->toggle = 1;
			if (ep_dir) {
				temp |= USBHS_HSTPIPCFG_PTOKEN_IN |
				    USBHS_HSTPIPCFG_PTYPE(UE_CONTROL);
				/* enable interrupts */
				ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x),
				    USBHS_HSTPIPIER_RXSTALLED |
				    USBHS_HSTPIPIER_PERR |
				    USBHS_HSTPIPIER_RXIN);
			} else {
				temp |= USBHS_HSTPIPCFG_PTOKEN_OUT |
				    USBHS_HSTPIPCFG_PTYPE(UE_CONTROL);
				/* enable interrupts */
				ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x),
				    USBHS_HSTPIPIER_RXSTALLED |
				    USBHS_HSTPIPIER_PERR |
				    USBHS_HSTPIPIER_TXOUT);
			}
		} else {
			temp |= USBHS_HSTPIPCFG_PTOKEN_SETUP |
			    USBHS_HSTPIPCFG_PTYPE(UE_CONTROL);
			/* enable interrupts */
			ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x),
			    USBHS_HSTPIPIER_RXSTALLED |
			    USBHS_HSTPIPIER_PERR |
			    USBHS_HSTPIPIER_TXSTP);
		}
		break;
	case UE_BULK:
		if (ep_dir) {
			temp |= USBHS_HSTPIPCFG_PTOKEN_IN |
			    USBHS_HSTPIPCFG_PTYPE(UE_CONTROL);
			/* enable interrupts */
			ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x),
			    USBHS_HSTPIPIER_RXSTALLED |
			    USBHS_HSTPIPIER_PERR |
			    USBHS_HSTPIPIER_RXIN);
		} else {
			temp |= USBHS_HSTPIPCFG_PTOKEN_OUT |
			    USBHS_HSTPIPCFG_PTYPE(UE_CONTROL);
			/* enable interrupts */
			ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x),
			    USBHS_HSTPIPIER_RXSTALLED |
			    USBHS_HSTPIPIER_PERR |
			    USBHS_HSTPIPIER_TXOUT);
		}
		break;
	case UE_INTERRUPT:
		if (ep_dir) {
			temp |= USBHS_HSTPIPCFG_PTOKEN_IN |
			    USBHS_HSTPIPCFG_PTYPE(UE_INTERRUPT);
			/* enable interrupts */
			ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x),
			    USBHS_HSTPIPIER_RXSTALLED |
			    USBHS_HSTPIPIER_PERR |
			    USBHS_HSTPIPIER_RXIN);
		} else {
			temp |= USBHS_HSTPIPCFG_PTOKEN_OUT |
			    USBHS_HSTPIPCFG_PTYPE(UE_INTERRUPT);
			/* enable interrupts */
			ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x),
			    USBHS_HSTPIPIER_RXSTALLED |
			    USBHS_HSTPIPIER_PERR |
			    USBHS_HSTPIPIER_TXOUT);
		}
		break;
	default:
		if (ep_dir) {
			temp |= USBHS_HSTPIPCFG_PTOKEN_IN |
			    USBHS_HSTPIPCFG_PTYPE(UE_ISOCHRONOUS);
			/* enable interrupts */
			ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x),
			    USBHS_HSTPIPIER_SHORTPACKET |
			    USBHS_HSTPIPIER_PERR |
			    USBHS_HSTPIPIER_RXIN);
		} else {
			temp |= USBHS_HSTPIPCFG_PTOKEN_OUT |
			    USBHS_HSTPIPCFG_PTYPE(UE_ISOCHRONOUS);
			/* enable interrupts */
			ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x),
			    USBHS_HSTPIPIER_PERR |
			    USBHS_HSTPIPIER_TXOUT);
		}
		break;
	}

	/* full configuration */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPCFG(x), temp);

	/* set host address */
	temp = ATS_OTG_READ_4(sc, USBHS_HSTADDR(x / 4));
	temp &= ~USBHS_HSTADDR_ADDR(-1U, x % 4);
	temp |= USBHS_HSTADDR_ADDR(td->dev_addr, x % 4);
	ATS_OTG_WRITE_4(sc, USBHS_HSTADDR(x / 4), temp);

