grisp-org/rtems-libbsd/rtemsbsd/sys/dev/usb/controller/atsam_otg.c
	/* clear data toggle */
	if (td->toggle == 0)
		ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x), USBHS_HSTPIPIER_RSTDT);

	/* enable interrupts */
	ATS_OTG_WRITE_4(sc, USBHS_HSTIER, USBHS_HSTIER_PEP(x));

	return (0);			/* allocated */
}

static void
ats_otg_host_channel_free(struct ats_otg_softc *sc, struct ats_otg_td *td)
{
	uint32_t temp;
	uint8_t x;

	if (td->channel == ATS_OTG_MAX_HOST_CHANNELS)
		return;			/* already freed */

	/* free channel */
	x = td->channel;
	td->channel = ATS_OTG_MAX_HOST_CHANNELS;

	DPRINTF("CH=%d\n", x);

	sc->sc_chan_state[x].allocated = 0;

	/* disable token generation */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIER(x), USBHS_HSTPIPIER_PFREEZ);

	/* disable host channel */
	temp = ATS_OTG_READ_4(sc, USBHS_HSTPIP);
	temp &= ~(USBHS_HSTPIP_PEN(x) | USBHS_HSTPIP_PRST(x));
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIP, temp);

	/* disable interrupts */
	ATS_OTG_WRITE_4(sc, USBHS_HSTIDR, USBHS_HSTIDR_PEP(x));
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIDR(x),
	    USBHS_HSTPIPIDR_NBUSYBK |
	    USBHS_HSTPIPIDR_SHORTPACKET |
	    USBHS_HSTPIPIDR_RXSTALLED |
	    USBHS_HSTPIPIDR_CRCERR |
	    USBHS_HSTPIPIDR_OVERF |
	    USBHS_HSTPIPIDR_NAKED |
	    USBHS_HSTPIPIDR_PERR |
	    USBHS_HSTPIPIDR_TXSTP |
	    USBHS_HSTPIPIDR_TXOUT |
	    USBHS_HSTPIPIDR_RXIN);

	/* clear pending interrupts */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPICR(x), -1U);

	/* clear PIPE errors */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPERR(x), 0);
}

static uint8_t
ats_otg_host_setup_tx(struct ats_otg_softc *sc, struct ats_otg_td *td)
{
	struct usb_device_request req __aligned(4);
	uint32_t temp;

	/* try to allocate a free channel */
	if (td->channel == ATS_OTG_MAX_HOST_CHANNELS) {
		td->channel = ats_otg_host_channel_alloc(sc, td, 0);
		if (td->channel == ATS_OTG_MAX_HOST_CHANNELS)
			return (1);	/* busy */
	}
	/* get endpoint status */
	temp = ATS_OTG_READ_4(sc, USBHS_HSTPIPISR(td->channel));

	/* clear all interrupts */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPICR(td->channel), temp);

	DPRINTFN(5, "HSTPIPISR(%d)=0x%08x\n", td->channel, temp);

	/* check transfer status */
	if (temp & (USBHS_HSTPIPISR_RXSTALLED | USBHS_HSTPIPISR_PERR)) {
		td->error_any = 1;
		ats_otg_host_channel_free(sc, td);
		return (0);		/* complete */
	} else if (temp & USBHS_DEVEPTISR_NBUSYBK(-1U)) {
		/* cannot write any data - a bank is busy */
		return (1);		/* busy */
	} else if (td->remainder == 0) {
		/* we are complete */
		ats_otg_host_channel_free(sc, td);
		/* update data toggle */
		td->toggle ^= 1;
		return (0);		/* complete */
	} else if (td->remainder != sizeof(req)) {
		DPRINTFN(0, "Unsupported SETUP packet "
		    "length, %d bytes\n", td->remainder);
		td->error_any = 1;
		ats_otg_host_channel_free(sc, td);
		return (0);		/* complete */
	}
	/* copy data into real buffer */
	usbd_copy_out(td->pc, 0, &req, sizeof(req));

	ATS_OTG_WRITE_FIFO_1(sc, td->channel, (void *)&req, sizeof(req));

	/* update offset and remainder */
	td->offset += sizeof(req);
	td->remainder -= sizeof(req);

	/* allocate FIFO bank and start token generation */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIDR(td->channel),
	    USBHS_HSTPIPIDR_FIFOCON | USBHS_HSTPIPIDR_PFREEZ);

	return (1);			/* busy */
}

static uint8_t
ats_otg_host_data_rx(struct ats_otg_softc *sc, struct ats_otg_td *td)
{
	struct usb_page_search buf_res;
	uint32_t temp;
	uint16_t count;
	uint8_t got_short;

	/* try to allocate a free channel */
	if (td->channel == ATS_OTG_MAX_HOST_CHANNELS) {
		td->channel = ats_otg_host_channel_alloc(sc, td, 1);
		if (td->channel == ATS_OTG_MAX_HOST_CHANNELS)
			return (1);	/* busy */
	}
	got_short = 0;

	/* get endpoint status */
	temp = ATS_OTG_READ_4(sc, USBHS_HSTPIPISR(td->channel));

	/* clear all interrupts */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPICR(td->channel), temp);

	DPRINTFN(5, "HSTPIPISR(%u)=0x%08x rem=%u\n",
	    td->channel, temp, td->remainder);

	/* check for transfer errors */
	if (temp & USBHS_HSTPIPISR_RXSTALLED) {
		td->error_any = 1;
		td->error_stall = 1;
		ats_otg_host_channel_free(sc, td);
		return (0);		/* complete */
	} else if (temp & USBHS_HSTPIPISR_PERR) {
		td->error_any = 1;
		ats_otg_host_channel_free(sc, td);
		return (0);		/* complete */
	} else if ((temp & USBHS_DEVEPTISR_NBUSYBK(-1U)) == 0) {
		/* cannot read any data */
		if (td->did_nak == 0)
			goto start_in;
		return (1);		/* busy */
	}
	/* get the packet byte count */
	count = (temp & USBHS_HSTPIPISR_BYCT(-1U)) /
	    USBHS_HSTPIPISR_BYCT(1);

	/* verify the packet byte count */
	if (count != td->max_packet_size) {
		if (count < td->max_packet_size) {
			/* we have a short packet */
			td->short_pkt = 1;
			got_short = 1;
		} else {
			/* invalid USB packet */
			td->error_any = 1;
			ats_otg_host_channel_free(sc, td);
			return (0);	/* we are complete */
		}
	}
	/* verify the packet byte count */
	if (count > td->remainder) {
		/* invalid USB packet */
		td->error_any = 1;
		ats_otg_host_channel_free(sc, td);
		return (0);		/* we are complete */
	}
	while (count > 0) {
		usbd_get_page(td->pc, td->offset, &buf_res);

		/* get correct length */
		if (buf_res.length > count) {
			buf_res.length = count;
		}
		/* receive data */
		ATS_OTG_READ_FIFO_1(sc, td->channel, buf_res.buffer, buf_res.length);

		/* update counters */
		count -= buf_res.length;
		td->offset += buf_res.length;
		td->remainder -= buf_res.length;
	}

	/* update data toggle */
	td->toggle ^= 1;

	/* release FIFO bank */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIDR(td->ep_no), USBHS_HSTPIPIDR_FIFOCON);

	/* check if we are complete */
	if ((td->remainder == 0) || got_short) {
		if (td->short_pkt) {
			/* we are complete */
			ats_otg_host_channel_free(sc, td);
			return (0);
		}
		/* else need to receive a zero length packet */
	}
start_in:
	/* only do it once */
	td->did_nak = 1;

	/* start generating an IN packet */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPINRQ(td->channel), 1);
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIDR(td->channel), USBHS_HSTPIPIDR_PFREEZ);
	return (1);			/* not complete */
}

static uint8_t
ats_otg_host_data_tx(struct ats_otg_softc *sc, struct ats_otg_td *td)
{
	struct usb_page_search buf_res;
	uint32_t temp;
	uint16_t count;

	/* try to allocate a free channel */
	if (td->channel == ATS_OTG_MAX_HOST_CHANNELS) {
		td->channel = ats_otg_host_channel_alloc(sc, td, 0);
		if (td->channel == ATS_OTG_MAX_HOST_CHANNELS)
			return (1);	/* busy */
	}
	/* get endpoint status */
	temp = ATS_OTG_READ_4(sc, USBHS_HSTPIPISR(td->channel));

	/* clear all interrupts */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPICR(td->channel), temp);

