grisp-org/rtems-libbsd/rtemsbsd/sys/dev/usb/controller/atsam_otg.c
	DPRINTFN(5, "HSTPIPISR(%u)=0x%08x rem=%u\n",
	    td->channel, temp, td->remainder);

	/* check for transfer errors */
	if (temp & USBHS_HSTPIPISR_RXSTALLED) {
		td->error_any = 1;
		td->error_stall = 1;
		ats_otg_host_channel_free(sc, td);
		return (0);		/* complete */
	} else if (temp & USBHS_HSTPIPISR_PERR) {
		td->error_any = 1;
		ats_otg_host_channel_free(sc, td);
		return (0);		/* complete */
	} else if (temp & USBHS_DEVEPTISR_NBUSYBK(-1U)) {
		/* cannot write any data - a bank is busy */
		return (1);		/* busy */
	} else if (td->remainder == 0) {
		if (td->short_pkt) {
			ats_otg_host_channel_free(sc, td);
			return (0);	/* complete */
		}
		/* else we need to transmit a short packet */
	}
	/* update data toggle */
	td->toggle ^= 1;

	count = td->max_packet_size;
	if (td->remainder < count) {
		/* we have a short packet */
		td->short_pkt = 1;
		count = td->remainder;
	}
	while (count > 0) {

		usbd_get_page(td->pc, td->offset, &buf_res);

		/* get correct length */
		if (buf_res.length > count) {
			buf_res.length = count;
		}
		/* transmit data */
		ATS_OTG_WRITE_FIFO_1(sc, td->channel, buf_res.buffer, buf_res.length);

		/* update counters */
		count -= buf_res.length;
		td->offset += buf_res.length;
		td->remainder -= buf_res.length;
	}

	/* allocate FIFO bank and start token generation */
	ATS_OTG_WRITE_4(sc, USBHS_HSTPIPIDR(td->channel),
	    USBHS_HSTPIPIDR_FIFOCON | USBHS_HSTPIPIDR_PFREEZ);

	return (1);			/* not complete */
}

static void
ats_otg_xfer_do_fifo(struct ats_otg_softc *sc, struct usb_xfer *xfer)
{
	struct ats_otg_td *td;
	uint8_t toggle;

	DPRINTFN(9, "\n");

	td = xfer->td_transfer_cache;
	if (td == NULL)
		return;

	while (1) {
		if ((td->func) (sc, td)) {
			/* operation in progress */
			break;
		}
		if (((void *)td) == xfer->td_transfer_last) {
			goto done;
		}
		if (td->error_any) {
			goto done;
		} else if (td->remainder > 0) {
			/*
			 * We had a short transfer. If there is no alternate
			 * next, stop processing !
			 */
			if (!td->alt_next) {
				goto done;
			}
		}
		/*
		 * Fetch the next transfer descriptor and transfer
		 * some flags to the next transfer descriptor
		 */
		toggle = td->toggle;
		td = td->obj_next;
		xfer->td_transfer_cache = td;
		td->toggle = toggle;	/* transfer toggle */
	}
	return;

done:
	xfer->td_transfer_cache = NULL;
	sc->sc_xfer_complete = 1;
}

static void
ats_otg_update_host_transfer_schedule_locked(struct ats_otg_softc *sc)
{
	TAILQ_HEAD(, usb_xfer) head;
	struct usb_xfer *xfer;
	struct usb_xfer *xfer_next;
	struct ats_otg_td *td;

	TAILQ_INIT(&head);

	TAILQ_FOREACH_SAFE(xfer, &sc->sc_bus.intr_q.head, wait_entry, xfer_next) {
		td = xfer->td_transfer_cache;
		if (td == NULL || td->ep_type != UE_ISOCHRONOUS)
			continue;

		TAILQ_REMOVE(&sc->sc_bus.intr_q.head, xfer, wait_entry);
		TAILQ_INSERT_TAIL(&head, xfer, wait_entry);
	}
	TAILQ_FOREACH_SAFE(xfer, &sc->sc_bus.intr_q.head, wait_entry, xfer_next) {
		td = xfer->td_transfer_cache;
		if (td == NULL || td->ep_type != UE_INTERRUPT)
			continue;
		TAILQ_REMOVE(&sc->sc_bus.intr_q.head, xfer, wait_entry);
		TAILQ_INSERT_TAIL(&head, xfer, wait_entry);
	}
	TAILQ_FOREACH_SAFE(xfer, &sc->sc_bus.intr_q.head, wait_entry, xfer_next) {
		td = xfer->td_transfer_cache;
		if (td == NULL || td->ep_type != UE_CONTROL)
			continue;
		TAILQ_REMOVE(&sc->sc_bus.intr_q.head, xfer, wait_entry);
		TAILQ_INSERT_TAIL(&head, xfer, wait_entry);
	}
	TAILQ_FOREACH_SAFE(xfer, &sc->sc_bus.intr_q.head, wait_entry, xfer_next) {
		td = xfer->td_transfer_cache;
		if (td == NULL || td->ep_type != UE_BULK)
			continue;
		TAILQ_REMOVE(&sc->sc_bus.intr_q.head, xfer, wait_entry);
		TAILQ_INSERT_TAIL(&head, xfer, wait_entry);
	}

	/* Put transfers in execution order at the end */
	TAILQ_CONCAT(&sc->sc_bus.intr_q.head, &head, wait_entry);
}

static void
ats_otg_interrupt_poll_locked(struct ats_otg_softc *sc)
{
	struct usb_xfer *xfer;

	if (sc->sc_flags.status_device_mode == 0) {
		/* Update host transfer schedule */
		ats_otg_update_host_transfer_schedule_locked(sc);
	}
	/* execute FIFOs */
	TAILQ_FOREACH(xfer, &sc->sc_bus.intr_q.head, wait_entry)
	    ats_otg_xfer_do_fifo(sc, xfer);
}

static uint8_t
ats_otg_xfer_do_complete_locked(struct ats_otg_softc *sc, struct usb_xfer *xfer)
{
	struct ats_otg_td *td;

	DPRINTFN(9, "\n");

	td = xfer->td_transfer_cache;
	if (td == NULL) {
		/* compute all actual lengths */
		ats_otg_standard_done(xfer);
		return (1);
	}
	return (0);
}

static void
ats_otg_interrupt_complete_locked(struct ats_otg_softc *sc)
{
	struct usb_xfer *xfer;

repeat:
	/* scan for completion events */
	TAILQ_FOREACH(xfer, &sc->sc_bus.intr_q.head, wait_entry) {
		if (ats_otg_xfer_do_complete_locked(sc, xfer))
			goto repeat;
	}
}

int
ats_otg_filter_interrupt(void *arg)
{
	struct ats_otg_softc *sc = arg;
	int retval = FILTER_HANDLED;
	uint32_t temp;

	USB_BUS_SPIN_LOCK(&sc->sc_bus);

	/* read and clear device interrupt status */
	temp = ATS_OTG_READ_4(sc, USBHS_DEVISR);

	/* clear interrupts we are handling here */
	ATS_OTG_WRITE_4(sc, USBHS_DEVICR, temp & ~ATS_OTG_DEVIMR_THREAD_IRQ);

	/* check for USB state change interrupts */
	if ((temp & ATS_OTG_DEVIMR_THREAD_IRQ) != 0)
		retval = FILTER_SCHEDULE_THREAD;

	/* read and clear host interrupt status */
	temp = ATS_OTG_READ_4(sc, USBHS_HSTISR);

	/* clear interrupts we are handling here */
	ATS_OTG_WRITE_4(sc, USBHS_HSTICR, temp & ~ATS_OTG_HSTIMR_THREAD_IRQ);

	/* check for USB state change interrupts */
	if ((temp & ATS_OTG_HSTIMR_THREAD_IRQ) != 0)
		retval = FILTER_SCHEDULE_THREAD;

	/* poll FIFOs, if any */
	ats_otg_interrupt_poll_locked(sc);

	if (sc->sc_xfer_complete != 0)
		retval = FILTER_SCHEDULE_THREAD;

	USB_BUS_SPIN_UNLOCK(&sc->sc_bus);

	return (retval);
}

void
ats_otg_interrupt(void *arg)
{
	struct ats_otg_softc *sc = arg;
	uint32_t temp;

	USB_BUS_LOCK(&sc->sc_bus);
	USB_BUS_SPIN_LOCK(&sc->sc_bus);

	/* read and clear device interrupt status */
	temp = ATS_OTG_READ_4(sc, USBHS_DEVISR);

	/* clear interrupts we are handling here */
	ATS_OTG_WRITE_4(sc, USBHS_DEVICR, temp & ATS_OTG_DEVIMR_THREAD_IRQ);

	DPRINTFN(14, "DEVISR=0x%08x\n", temp);

	/* check for any bus state change interrupts */
	if (temp & USBHS_DEVISR_EORST) {

