grisp-org/rtems-libbsd/rtemsbsd/sys/dev/usb/controller/atsam_otg.c
		uint32_t speed;

		DPRINTFN(5, "end of reset\n");

		/* set correct state */
		sc->sc_flags.status_device_mode = 1;
		sc->sc_flags.status_bus_reset = 1;
		sc->sc_flags.status_suspend = 0;
		sc->sc_flags.change_suspend = 0;
		sc->sc_flags.change_connect = 1;
		sc->sc_flags.status_high_speed = 0;
		sc->sc_flags.status_low_speed = 0;
		sc->sc_flags.port_enabled = 1;

		/* reset FIFOs */
		ats_otg_init_fifo(sc, ATS_MODE_DEVICE);

		/* reset function address */
		ats_otg_set_address(sc, 0);

		/* figure out enumeration speed */
		speed = ATS_OTG_READ_4(sc, USBHS_SR) & USBHS_SR_SPEED(-1U);
		if (speed == USBHS_SR_SPEED_HIGH)
			sc->sc_flags.status_high_speed = 1;
		else if (speed == USBHS_SR_SPEED_LOW)
			sc->sc_flags.status_low_speed = 1;

		/* Disable resume and enable suspend interrupt */
		ATS_OTG_WRITE_4(sc, USBHS_DEVIDR, USBHS_DEVIDR_WAKEUP);
		ATS_OTG_WRITE_4(sc, USBHS_DEVIER, USBHS_DEVIER_SUSP);

		/* complete root HUB interrupt endpoint */
		ats_otg_root_intr(sc);
	}
	/*
	 * If resume and suspend is set at the same time we interpret
	 * that like RESUME. Resume is set when there is at least 3
	 * milliseconds of inactivity on the USB BUS.
	 */
	if (temp & USBHS_DEVISR_WAKEUP) {

		DPRINTFN(5, "resume interrupt\n");

		ats_otg_resume_irq(sc);

	} else if (temp & USBHS_DEVISR_SUSP) {

		DPRINTFN(5, "suspend interrupt\n");

		ats_otg_suspend_irq(sc);
	}
	/* read and clear host interrupt status */
	temp = ATS_OTG_READ_4(sc, USBHS_HSTISR);

	/* clear interrupts we are handling here */
	ATS_OTG_WRITE_4(sc, USBHS_HSTICR, temp & ATS_OTG_HSTIMR_THREAD_IRQ);

	DPRINTFN(14, "HSTISR=0x%08x\n", temp);

	if (temp & (USBHS_HSTISR_DCONN | USBHS_HSTISR_HWUP)) {
		sc->sc_flags.status_device_mode = 0;
		sc->sc_flags.status_bus_reset = 1;
		sc->sc_flags.change_connect = 1;

		/* complete root HUB interrupt endpoint */
		ats_otg_root_intr(sc);
	} else if (temp & USBHS_HSTISR_DDISC) {
		sc->sc_flags.status_device_mode = 0;
		sc->sc_flags.status_bus_reset = 0;
		sc->sc_flags.change_connect = 1;
		sc->sc_flags.port_enabled = 0;
		sc->sc_flags.change_enabled = 1;

		/* complete root HUB interrupt endpoint */
		ats_otg_root_intr(sc);
	} else if (temp & USBHS_HSTISR_RST) {
		uint32_t speed;

		sc->sc_flags.status_bus_reset = 1;
		sc->sc_flags.status_device_mode = 0;
		sc->sc_flags.status_high_speed = 0;
		sc->sc_flags.status_low_speed = 0;
		sc->sc_flags.change_enabled = 1;
		sc->sc_flags.port_enabled = 1;

		/* figure out enumeration speed */
		speed = ATS_OTG_READ_4(sc, USBHS_SR) & USBHS_SR_SPEED(-1U);
		if (speed == USBHS_SR_SPEED_HIGH)
			sc->sc_flags.status_high_speed = 1;
		else if (speed == USBHS_SR_SPEED_LOW)
			sc->sc_flags.status_low_speed = 1;

		/* complete root HUB interrupt endpoint */
		ats_otg_root_intr(sc);
	}
	if (sc->sc_flags.status_device_mode == 0 &&
	    sc->sc_flags.status_bus_reset != 0) {
		uint32_t sof;

		sof = ATS_OTG_READ_4(sc, USBHS_HSTCTRL);
		if (sof & USBHS_HSTCTRL_SOFE)
			ats_otg_resume_irq(sc);
		else
			ats_otg_suspend_irq(sc);
	}
	if (sc->sc_xfer_complete != 0) {
		sc->sc_xfer_complete = 0;

		/* complete FIFOs, if any */
		ats_otg_interrupt_complete_locked(sc);
	}
	USB_BUS_SPIN_UNLOCK(&sc->sc_bus);
	USB_BUS_UNLOCK(&sc->sc_bus);
}

static void
ats_otg_setup_standard_chain_sub(struct ats_otg_std_temp *temp)
{
	struct ats_otg_td *td;

	/* get current Transfer Descriptor */
	td = temp->td_next;
	temp->td = td;

	/* prepare for next TD */
	temp->td_next = td->obj_next;

	/* fill out the Transfer Descriptor */
	td->func = temp->func;
	td->pc = temp->pc;
	td->offset = temp->offset;
	td->remainder = temp->len;
	td->error_any = 0;
	td->error_stall = 0;
	td->did_stall = temp->did_stall;
	td->short_pkt = temp->short_pkt;
	td->alt_next = temp->setup_alt_next;
	td->set_toggle = 0;
	td->got_short = 0;
	td->did_nak = 0;
	td->channel = ATS_OTG_MAX_HOST_CHANNELS;
	td->errcnt = 0;
}

static void
ats_otg_setup_standard_chain(struct usb_xfer *xfer)
{
	struct ats_otg_std_temp temp;
	struct ats_otg_td *td;
	uint32_t x;
	uint8_t need_sync;
	uint8_t is_host;

	DPRINTFN(9, "addr=%d endpt=%d sumlen=%d speed=%d\n",
	    xfer->address, UE_GET_ADDR(xfer->endpointno),
	    xfer->sumlen, usbd_get_speed(xfer->xroot->udev));

	temp.max_frame_size = xfer->max_frame_size;

	td = xfer->td_start[0];
	xfer->td_transfer_first = td;
	xfer->td_transfer_cache = td;

	/* setup temp */

	temp.pc = NULL;
	temp.td = NULL;
	temp.td_next = xfer->td_start[0];
	temp.offset = 0;
	temp.setup_alt_next = xfer->flags_int.short_frames_ok ||
	    xfer->flags_int.isochronous_xfr;
	temp.did_stall = !xfer->flags_int.control_stall;

	is_host = (xfer->xroot->udev->flags.usb_mode == USB_MODE_HOST);

	/* check if we should prepend a setup message */

	if (xfer->flags_int.control_xfr) {
		if (xfer->flags_int.control_hdr) {

			if (is_host)
				temp.func = &ats_otg_host_setup_tx;
			else
				temp.func = &ats_otg_device_setup_rx;

			temp.len = xfer->frlengths[0];
			temp.pc = xfer->frbuffers + 0;
			temp.short_pkt = temp.len ? 1 : 0;

			/* check for last frame */
			if (xfer->nframes == 1) {
				/* no STATUS stage yet, SETUP is last */
				if (xfer->flags_int.control_act)
					temp.setup_alt_next = 0;
			}
			ats_otg_setup_standard_chain_sub(&temp);
		}
		x = 1;
	} else {
		x = 0;
	}

	if (x != xfer->nframes) {
		if (xfer->endpointno & UE_DIR_IN) {
			if (is_host) {
				temp.func = &ats_otg_host_data_rx;
				need_sync = 0;
			} else {
				temp.func = &ats_otg_device_data_tx;
				need_sync = 1;
			}
		} else {
			if (is_host) {
				temp.func = &ats_otg_host_data_tx;
				need_sync = 0;
			} else {
				temp.func = &ats_otg_device_data_rx;
				need_sync = 0;
			}
		}

		/* setup "pc" pointer */
		temp.pc = xfer->frbuffers + x;
	} else {
		need_sync = 0;
	}
	while (x != xfer->nframes) {

		/* DATA0 / DATA1 message */

		temp.len = xfer->frlengths[x];

		x++;

		if (x == xfer->nframes) {
			if (xfer->flags_int.control_xfr) {
				if (xfer->flags_int.control_act) {
					temp.setup_alt_next = 0;
				}
			} else {
				temp.setup_alt_next = 0;
			}
		}
		if (temp.len == 0) {

			/* make sure that we send an USB packet */

			temp.short_pkt = 0;

		} else {

