grisp-org/rtems-libbsd/rtemsbsd/sys/dev/usb/controller/atsam_otg.c
	USB_BUS_SPIN_LOCK(&sc->sc_bus);

	/* get endpoint address */
	ep_no = ep->edesc->bEndpointAddress;

	DPRINTFN(5, "endpoint=0x%x\n", ep_no);

	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIER(ep_no), USBHS_DEVEPTIER_STALLRQ);

	USB_BUS_SPIN_UNLOCK(&sc->sc_bus);
}

static void
ats_otg_clear_stall_sub_locked(struct ats_otg_softc *sc, uint32_t mps,
    uint8_t ep_no, uint8_t ep_type, uint8_t ep_dir)
{
	uint32_t temp;

	if (ep_type == UE_CONTROL) {
		/* clearing stall is not needed */
		return;
	}
	temp = ATS_OTG_READ_4(sc, USBHS_DEVEPT);
	/* enable endpoint */
	temp |= USBHS_DEVEPT_EPEN(ep_no);
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPT, temp);

	/* reset endpoint */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPT, temp | USBHS_DEVEPT_EPRST(ep_no));
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPT, temp);

	/* configure endpoint type */
	temp = ATS_OTG_READ_4(sc, USBHS_DEVEPTCFG(ep_no));
	temp &= ~(USBHS_DEVEPTCFG_EPTYPE(-1U) | USBHS_DEVEPTCFG_EPDIR);
	temp |= USBHS_DEVEPTCFG_EPTYPE(ep_type);
	if (ep_dir)
		temp |= USBHS_DEVEPTCFG_EPDIR;
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTCFG(ep_no), temp);

	/* reset data tooggle and clear stall */
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIER(ep_no), USBHS_DEVEPTIER_RSTDT);
	ATS_OTG_WRITE_4(sc, USBHS_DEVEPTIDR(ep_no), USBHS_DEVEPTIDR_STALLRQ);

	/* poll interrupt */
	ats_otg_interrupt_poll_locked(sc);
	ats_otg_interrupt_complete_locked(sc);
}

static void
ats_otg_clear_stall(struct usb_device *udev, struct usb_endpoint *ep)
{
	struct ats_otg_softc *sc;
	struct usb_endpoint_descriptor *ed;

	DPRINTFN(5, "endpoint=%p\n", ep);

	USB_BUS_LOCK_ASSERT(udev->bus, MA_OWNED);

	/* check mode */
	if (udev->flags.usb_mode != USB_MODE_DEVICE) {
		/* not supported */
		return;
	}
	/* get softc */
	sc = ATS_OTG_BUS2SC(udev->bus);

	USB_BUS_SPIN_LOCK(&sc->sc_bus);

	/* get endpoint descriptor */
	ed = ep->edesc;

	/* reset endpoint */
	ats_otg_clear_stall_sub_locked(sc,
	    UGETW(ed->wMaxPacketSize),
	    (ed->bEndpointAddress & UE_ADDR),
	    (ed->bmAttributes & UE_XFERTYPE),
	    (ed->bEndpointAddress & (UE_DIR_IN | UE_DIR_OUT)));

	USB_BUS_SPIN_UNLOCK(&sc->sc_bus);
}

static void
ats_otg_device_state_change(struct usb_device *udev)
{
	/* check mode */
	if (udev->flags.usb_mode != USB_MODE_DEVICE) {
		/* not supported */
		return;
	}
	/* deactivate all other endpoint but the control endpoint */
	if (udev->state == USB_STATE_CONFIGURED ||
	    udev->state == USB_STATE_ADDRESSED) {
		struct ats_otg_softc *sc;
		uint8_t x;

		/* get softc */
		sc = ATS_OTG_BUS2SC(udev->bus);

		USB_BUS_LOCK(&sc->sc_bus);
		ATS_OTG_WRITE_4(sc, USBHS_DEVEPT, USBHS_DEVEPT_EPEN(0));

		for (x = 1; x != ATS_OTG_MAX_DEVICE_ENDPOINTS; x++)
			ATS_OTG_WRITE_4(sc, USBHS_DEVEPTICR(x), -1U);
		USB_BUS_UNLOCK(&sc->sc_bus);
	}
}

/* The FIFO layout must fit within 4K */
static void
ats_otg_init_fifo(struct ats_otg_softc *sc, uint8_t mode)
{
	uint32_t temp;
	uint8_t x;

	if (mode == ATS_MODE_HOST) {
		for (x = 0; x != ATS_OTG_MAX_HOST_CHANNELS; x++) {
			ATS_OTG_WRITE_4(sc, USBHS_HSTPIPCFG(x),
			    USBHS_HSTPIPCFG_PSIZE_512 | USBHS_HSTPIPCFG_PBK_1);
			ATS_OTG_WRITE_4(sc, USBHS_HSTPIPCFG(x),
			    USBHS_HSTPIPCFG_PSIZE_512 | USBHS_HSTPIPCFG_PBK_1 |
			    USBHS_HSTPIPCFG_ALLOC);
			sc->sc_fifo_offset[x] = 512 * x;
		}
	} else {
		temp = 0;
		for (x = 0; x != ATS_OTG_MAX_DEVICE_ENDPOINTS; x++) {
			sc->sc_fifo_offset[x] = temp;
			if (x == 0 || x >= ATS_OTG_MAX_DEVICE_HS_EP) {
				ATS_OTG_WRITE_4(sc, USBHS_DEVEPTCFG(x),
				    USBHS_DEVEPTCFG_EPSIZE_64 | USBHS_DEVEPTCFG_EPBK_1);
				ATS_OTG_WRITE_4(sc, USBHS_DEVEPTCFG(x),
				    USBHS_DEVEPTCFG_EPSIZE_64 | USBHS_DEVEPTCFG_EPBK_1 |
				    USBHS_DEVEPTCFG_ALLOC);
				temp += 64;
			} else {
				ATS_OTG_WRITE_4(sc, USBHS_DEVEPTCFG(x),
				    USBHS_DEVEPTCFG_EPSIZE_512 | USBHS_DEVEPTCFG_EPBK_1);
				ATS_OTG_WRITE_4(sc, USBHS_DEVEPTCFG(x),
				    USBHS_DEVEPTCFG_EPSIZE_512 | USBHS_DEVEPTCFG_EPBK_1 |
				    USBHS_DEVEPTCFG_ALLOC);
				temp += 512;
			}
		}
	}
}

int
ats_otg_init(struct ats_otg_softc *sc)
{
	DPRINTF("start\n");

	/* set up the bus structure */
	sc->sc_bus.usbrev = USB_REV_2_0;
	sc->sc_bus.methods = &ats_otg_bus_methods;

	USB_BUS_LOCK(&sc->sc_bus);

	/* disable USB block */
	ATS_OTG_WRITE_4(sc, USBHS_CTRL, USBHS_CTRL_VBUSHWC);

	/* wait for host to detect disconnect */
	usb_pause_mtx(&sc->sc_bus.bus_mtx, hz / 32);

	ATS_OTG_WRITE_4(sc, USBHS_SFR, USBHS_SFR_VBUSRQS);

	switch (sc->sc_mode) {
	case ATS_MODE_HOST:
		ATS_OTG_WRITE_4(sc, USBHS_CTRL,
		    USBHS_CTRL_VBUSHWC | USBHS_CTRL_USBE);

		/* disable detach */
		ATS_OTG_WRITE_4(sc, USBHS_DEVCTRL, 0);

		/* try to set mode early on */
		sc->sc_flags.status_device_mode = 0;
		break;
	default:
		ATS_OTG_WRITE_4(sc, USBHS_CTRL,
		    USBHS_CTRL_VBUSHWC | USBHS_CTRL_USBE |
		    USBHS_CTRL_UIMOD);

		/* try to set mode early on */
		sc->sc_flags.status_device_mode = 1;
		break;
	}

	/* wait a little bit for block to enable */
	usb_pause_mtx(&sc->sc_bus.bus_mtx, hz / 128);

	/* enable interrupts */
	ATS_OTG_WRITE_4(sc, USBHS_DEVIER, ATS_OTG_DEVIMR_THREAD_IRQ);
	ATS_OTG_WRITE_4(sc, USBHS_HSTIER, ATS_OTG_HSTIMR_THREAD_IRQ);

	/* turn off clocks */
	ats_otg_clocks_off(sc);

	USB_BUS_UNLOCK(&sc->sc_bus);

	/* catch any lost interrupts */

	ats_otg_do_poll(&sc->sc_bus);

	return (0);			/* success */
}

void
ats_otg_uninit(struct ats_otg_softc *sc)
{
	USB_BUS_LOCK(&sc->sc_bus);

	/* disable USB block */
	ATS_OTG_WRITE_4(sc, USBHS_CTRL, USBHS_CTRL_VBUSHWC);

	/* enable interrupts */
	ATS_OTG_WRITE_4(sc, USBHS_DEVIDR, -1U);
	ATS_OTG_WRITE_4(sc, USBHS_HSTIDR, -1U);

	sc->sc_flags.port_enabled = 0;
	sc->sc_flags.port_powered = 0;
	sc->sc_flags.status_bus_reset = 0;
	sc->sc_flags.status_suspend = 0;
	sc->sc_flags.change_suspend = 0;
	sc->sc_flags.change_connect = 1;

	ats_otg_pull_down(sc);
	ats_otg_clocks_off(sc);

	USB_BUS_UNLOCK(&sc->sc_bus);
}

static void
ats_otg_suspend(struct ats_otg_softc *sc)
{
	return;
}

static void
ats_otg_resume(struct ats_otg_softc *sc)
{
	return;
}

static void
ats_otg_do_poll(struct usb_bus *bus)
{
	struct ats_otg_softc *sc = ATS_OTG_BUS2SC(bus);

	USB_BUS_LOCK(&sc->sc_bus);
	USB_BUS_SPIN_LOCK(&sc->sc_bus);
	ats_otg_interrupt_poll_locked(sc);
	ats_otg_interrupt_complete_locked(sc);
	USB_BUS_SPIN_UNLOCK(&sc->sc_bus);
	USB_BUS_UNLOCK(&sc->sc_bus);
}

/*------------------------------------------------------------------------*
 * ATS OTG BULK support
 * ATS OTG CONTROL support
 * ATS OTG INTERRUPT support
 *------------------------------------------------------------------------*/
static void
ats_otg_non_isoc_open(struct usb_xfer *xfer)
{
}

static void
ats_otg_non_isoc_close(struct usb_xfer *xfer)
{
	ats_otg_device_done(xfer, USB_ERR_CANCELLED);
}

static void
ats_otg_non_isoc_enter(struct usb_xfer *xfer)
{
}

static void
ats_otg_non_isoc_start(struct usb_xfer *xfer)
{
	/* setup TDs */
	ats_otg_setup_standard_chain(xfer);
	ats_otg_start_standard_chain(xfer);
}

