grisp-org/rtems-libbsd/rtemsbsd/sys/dev/usb/controller/atsam_otg.c
	/* Select Device Side Mode */

	if (sc->sc_flags.status_device_mode)
		value = UPS_PORT_MODE_DEVICE;
	else
		value = 0;

	if (sc->sc_flags.status_high_speed)
		value |= UPS_HIGH_SPEED;
	else if (sc->sc_flags.status_low_speed)
		value |= UPS_LOW_SPEED;

	if (sc->sc_flags.port_powered)
		value |= UPS_PORT_POWER;

	if (sc->sc_flags.port_enabled)
		value |= UPS_PORT_ENABLED;

	if (sc->sc_flags.port_over_current)
		value |= UPS_OVERCURRENT_INDICATOR;

	if (sc->sc_flags.status_bus_reset)
		value |= UPS_CURRENT_CONNECT_STATUS;

	if (sc->sc_flags.status_suspend)
		value |= UPS_SUSPEND;

	USETW(sc->sc_hub_temp.ps.wPortStatus, value);

	value = 0;

	if (sc->sc_flags.change_enabled)
		value |= UPS_C_PORT_ENABLED;
	if (sc->sc_flags.change_connect)
		value |= UPS_C_CONNECT_STATUS;
	if (sc->sc_flags.change_suspend)
		value |= UPS_C_SUSPEND;
	if (sc->sc_flags.change_reset)
		value |= UPS_C_PORT_RESET;
	if (sc->sc_flags.change_over_current)
		value |= UPS_C_OVERCURRENT_INDICATOR;

	USETW(sc->sc_hub_temp.ps.wPortChange, value);
	len = sizeof(sc->sc_hub_temp.ps);
	goto tr_valid;

tr_handle_get_class_descriptor:
	if (value & 0xFF) {
		goto tr_stalled;
	}
	ptr = (const void *)&ats_otg_hubd;
	len = sizeof(ats_otg_hubd);
	goto tr_valid;

tr_stalled:
	err = USB_ERR_STALLED;
tr_valid:
done:
	*plength = len;
	*pptr = ptr;
	return (err);
}

static void
ats_otg_xfer_setup(struct usb_setup_params *parm)
{
	struct usb_xfer *xfer;
	void *last_obj;
	uint32_t ntd;
	uint32_t n;
	uint8_t ep_no;
	uint8_t ep_type;

	xfer = parm->curr_xfer;

	/*
	 * NOTE: This driver does not use any of the parameters that
	 * are computed from the following values. Just set some
	 * reasonable dummies:
	 */
	parm->hc_max_packet_size = 0x500;
	parm->hc_max_packet_count = 3;
	parm->hc_max_frame_size = 3 * 0x500;

	usbd_transfer_setup_sub(parm);

	/*
	 * compute maximum number of TDs
	 */
	ep_type = (xfer->endpoint->edesc->bmAttributes & UE_XFERTYPE);

	if (ep_type == UE_CONTROL) {

		ntd = xfer->nframes + 1 /* STATUS */ + 1 /* SYNC 1 */
		    + 1 /* SYNC 2 */ + 1 /* SYNC 3 */ ;
	} else {

		ntd = xfer->nframes + 1 /* SYNC */ ;
	}

	/*
	 * check if "usbd_transfer_setup_sub" set an error
	 */
	if (parm->err)
		return;

	/*
	 * allocate transfer descriptors
	 */
	last_obj = NULL;

	ep_no = xfer->endpointno & UE_ADDR;

	/*
	 * Check for a valid endpoint profile in USB device mode:
	 */
	if (xfer->flags_int.usb_mode == USB_MODE_DEVICE) {
		const struct usb_hw_ep_profile *pf;

		ats_otg_get_hw_ep_profile(parm->udev, &pf, ep_no);

		if (pf == NULL) {
			/* should not happen */
			parm->err = USB_ERR_INVAL;
			return;
		}
	}
	/* align data */
	parm->size[0] += ((-parm->size[0]) & (USB_HOST_ALIGN - 1));

	for (n = 0; n != ntd; n++) {

		struct ats_otg_td *td;

		if (parm->buf) {

			td = USB_ADD_BYTES(parm->buf, parm->size[0]);

			/* init TD */
			td->max_packet_size = xfer->max_packet_size;
			td->max_packet_count = xfer->max_packet_count;
			/* range check */
			if (td->max_packet_count == 0 || td->max_packet_count > 3)
				td->max_packet_count = 1;
			td->ep_no = ep_no;
			td->ep_type = ep_type;
			td->dev_addr = xfer->address;
			td->obj_next = last_obj;

			last_obj = td;
		}
		parm->size[0] += sizeof(*td);
	}

	xfer->td_start[0] = last_obj;
}

static void
ats_otg_xfer_unsetup(struct usb_xfer *xfer)
{
	return;
}

static void
ats_otg_ep_init(struct usb_device *udev, struct usb_endpoint_descriptor *edesc,
    struct usb_endpoint *ep)
{
	struct ats_otg_softc *sc = ATS_OTG_BUS2SC(udev->bus);

	DPRINTFN(2, "endpoint=%p, addr=%d, endpt=%d, mode=%d (%d,%d)\n",
	    ep, udev->address,
	    edesc->bEndpointAddress, udev->flags.usb_mode,
	    sc->sc_rt_addr, udev->device_index);

	if (udev->device_index != sc->sc_rt_addr) {

		if (udev->flags.usb_mode == USB_MODE_DEVICE) {
			if (udev->speed != USB_SPEED_FULL &&
			    udev->speed != USB_SPEED_HIGH) {
				/* not supported */
				return;
			}
		} else {
			if (udev->speed == USB_SPEED_HIGH &&
			    (edesc->wMaxPacketSize[1] & 0x18) != 0) {
				/* not supported */
				DPRINTFN(-1, "High bandwidth endpoints are "
				    "not supported\n");
				return;
			}
			if (UGETW(edesc->wMaxPacketSize) >= 512) {
				/* not supported */
				DPRINTFN(-1, "wMaxPacketSize(%u) must be less than "
				    "or equal to 512 bytes\n",
				    UGETW(edesc->wMaxPacketSize));
				return;
			}
			if (udev->parent_hub != NULL &&
			    udev->speed != udev->parent_hub->speed) {
				/* not supported */
				DPRINTFN(-1, "USB split transactions are "
				    "not supported\n");
				return;
			}
		}
		if ((edesc->bmAttributes & UE_XFERTYPE) == UE_ISOCHRONOUS)
			ep->methods = &ats_otg_isoc_methods;
		else
			ep->methods = &ats_otg_non_isoc_methods;
	}
}

static void
ats_otg_set_hw_power_sleep(struct usb_bus *bus, uint32_t state)
{
	struct ats_otg_softc *sc = ATS_OTG_BUS2SC(bus);

	switch (state) {
	case USB_HW_POWER_SUSPEND:
		ats_otg_suspend(sc);
		break;
	case USB_HW_POWER_SHUTDOWN:
		ats_otg_uninit(sc);
		break;
	case USB_HW_POWER_RESUME:
		ats_otg_resume(sc);
		break;
	default:
		break;
	}
}

static void
ats_otg_get_dma_delay(struct usb_device *udev, uint32_t *pus)
{
	/* DMA delay - wait until any use of memory is finished */
	*pus = 0;			/* microseconds */
}

static void
ats_otg_device_resume(struct usb_device *udev)
{
	DPRINTF("\n");

	/* poll all transfers again to restart resumed ones */
	ats_otg_do_poll(udev->bus);
}

static void
ats_otg_device_suspend(struct usb_device *udev)
{
	DPRINTF("\n");
}

static const struct usb_bus_methods ats_otg_bus_methods =
{
	.endpoint_init = &ats_otg_ep_init,
	.xfer_setup = &ats_otg_xfer_setup,
	.xfer_unsetup = &ats_otg_xfer_unsetup,
	.get_hw_ep_profile = &ats_otg_get_hw_ep_profile,
	.xfer_stall = &ats_otg_xfer_stall,
	.set_stall = &ats_otg_set_stall,
	.clear_stall = &ats_otg_clear_stall,
	.roothub_exec = &ats_otg_roothub_exec,
	.xfer_poll = &ats_otg_do_poll,
	.device_state_change = &ats_otg_device_state_change,
	.set_hw_power_sleep = &ats_otg_set_hw_power_sleep,
	.get_dma_delay = &ats_otg_get_dma_delay,
	.device_resume = &ats_otg_device_resume,
	.device_suspend = &ats_otg_device_suspend,
};
